tests/results/fase6/jmeter/plans/JM-REN-02-login.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3"><hashTree><TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="JM-REN-02 Login" enabled="true"/><hashTree><ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="15 clientes"><stringProp name="ThreadGroup.num_threads">${__P(threads,15)}</stringProp><stringProp name="ThreadGroup.ramp_time">${__P(ramp,5)}</stringProp><boolProp name="ThreadGroup.scheduler">false</boolProp><elementProp name="ThreadGroup.main_controller" elementType="LoopController"><boolProp name="LoopController.continue_forever">false</boolProp><stringProp name="LoopController.loops">1</stringProp></elementProp></ThreadGroup><hashTree>
<CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Clientes"><stringProp name="filename">${__P(dataFile)}</stringProp><stringProp name="fileEncoding">UTF-8</stringProp><stringProp name="delimiter">,</stringProp><boolProp name="quotedData">true</boolProp><boolProp name="recycle">false</boolProp><boolProp name="stopThread">true</boolProp><boolProp name="ignoreFirstLine">true</boolProp><stringProp name="variableNames">email,password,addressId,productId,sessionToken</stringProp><stringProp name="shareMode">shareMode.all</stringProp></CSVDataSet><hashTree/>
<ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP defaults"><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"/></elementProp><stringProp name="HTTPSampler.domain">${__P(host,localhost)}</stringProp><stringProp name="HTTPSampler.port">${__P(port,3000)}</stringProp><stringProp name="HTTPSampler.protocol">${__P(protocol,http)}</stringProp><stringProp name="HTTPSampler.response_timeout">10000</stringProp></ConfigTestElement><hashTree/>
<HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="JSON"><collectionProp name="HeaderManager.headers"><elementProp name="Content-Type" elementType="Header"><stringProp name="Header.name">Content-Type</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp></collectionProp></HeaderManager><hashTree/>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="REN02 POST login"><boolProp name="HTTPSampler.postBodyRaw">true</boolProp><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{&quot;email&quot;:&quot;${email}&quot;,&quot;password&quot;:&quot;${password}&quot;}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.path">/api/auth/login</stringProp><stringProp name="HTTPSampler.method">POST</stringProp></HTTPSamplerProxy><hashTree><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="HTTP 200"><collectionProp name="Asserion.test_strings"><stringProp name="1">200</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Usuario y expiración"><collectionProp name="Asserion.test_strings"><stringProp name="1">&quot;user&quot;</stringProp><stringProp name="2">&quot;expiresAt&quot;</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_data</stringProp><intProp name="Assertion.test_type">2</intProp></ResponseAssertion><hashTree/><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Cookie sesión"><collectionProp name="Asserion.test_strings"><stringProp name="1">elpoblano_session=</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_headers</stringProp><intProp name="Assertion.test_type">2</intProp></ResponseAssertion><hashTree/></hashTree>
</hashTree></hashTree></hashTree></jmeterTestPlan>