tests/results/fase6/jmeter/plans/JM-REN-03-crear-pedidos.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3"><hashTree><TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="JM-REN-03 Crear pedidos" enabled="true"/><hashTree><ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="10 clientes concurrentes"><stringProp name="ThreadGroup.num_threads">${__P(threads,10)}</stringProp><stringProp name="ThreadGroup.ramp_time">${__P(ramp,1)}</stringProp><boolProp name="ThreadGroup.scheduler">false</boolProp><elementProp name="ThreadGroup.main_controller" elementType="LoopController"><boolProp name="LoopController.continue_forever">false</boolProp><stringProp name="LoopController.loops">1</stringProp></elementProp></ThreadGroup><hashTree>
<CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Clientes"><stringProp name="filename">${__P(dataFile)}</stringProp><stringProp name="fileEncoding">UTF-8</stringProp><stringProp name="delimiter">,</stringProp><boolProp name="quotedData">true</boolProp><boolProp name="recycle">false</boolProp><boolProp name="stopThread">true</boolProp><boolProp name="ignoreFirstLine">true</boolProp><stringProp name="variableNames">email,password,addressId,productId,sessionToken</stringProp><stringProp name="shareMode">shareMode.all</stringProp></CSVDataSet><hashTree/>
<ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP defaults"><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"/></elementProp><stringProp name="HTTPSampler.domain">${__P(host,localhost)}</stringProp><stringProp name="HTTPSampler.port">${__P(port,3000)}</stringProp><stringProp name="HTTPSampler.protocol">${__P(protocol,http)}</stringProp><stringProp name="HTTPSampler.response_timeout">10000</stringProp></ConfigTestElement><hashTree/>
<HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Pedido"><collectionProp name="HeaderManager.headers"><elementProp name="Content-Type" elementType="Header"><stringProp name="Header.name">Content-Type</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp><elementProp name="Cookie" elementType="Header"><stringProp name="Header.name">Cookie</stringProp><stringProp name="Header.value">elpoblano_session=${sessionToken}</stringProp></elementProp><elementProp name="Idempotency-Key" elementType="Header"><stringProp name="Header.name">Idempotency-Key</stringProp><stringProp name="Header.value">ren03-${__UUID()}</stringProp></elementProp></collectionProp></HeaderManager><hashTree/>
<SyncTimer guiclass="TestBeanGUI" testclass="SyncTimer" testname="Inicio simultáneo"><stringProp name="groupSize">${__P(threads,10)}</stringProp><stringProp name="timeoutInMs">10000</stringProp></SyncTimer><hashTree/>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="REN03 POST pedido"><boolProp name="HTTPSampler.postBodyRaw">true</boolProp><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{&quot;items&quot;:[{&quot;productId&quot;:&quot;${productId}&quot;,&quot;quantity&quot;:1}],&quot;paymentMethod&quot;:&quot;CREDIT_CARD&quot;,&quot;addressId&quot;:&quot;${addressId}&quot;,&quot;notes&quot;:&quot;[JM-REN-03]&quot;}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.path">/api/pedidos</stringProp><stringProp name="HTTPSampler.method">POST</stringProp></HTTPSamplerProxy><hashTree><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="HTTP 201"><collectionProp name="Asserion.test_strings"><stringProp name="1">201</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/></hashTree>
</hashTree></hashTree></hashTree></jmeterTestPlan>